stops-top/H-Tool/PC/h7toolPC_release/EMMC/H7-TOOL/Programmer/Device/Geehy/APEXMIC.APM32F1xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>APEXMIC</vendor>
    <name>APM32F1xx_DFP</name>
    <description>APEX Microelectronics APM32F1 Series Device Support, Drivers and Examples</description>
    <url>https://geehy.com/uploads/tool/</url><supportContact>https://www.geehy.com/support/apm</supportContact>
    <releases>
        <release version="1.0.0" date="2019-12-17">
      First Release version of APM32F1 Device Family Pack.
        </release>
        <release version="1.0.1" date="2020-04-26">
      Add APM32F103xCxDxE Device.
      Add CMSIS drivers:
      - DAC
      - DBGMCU
      - EMMC
      - QSPI
      - SCI2C
      - SDI0
      - SDRC
      Updated drivers.
        </release><release version="1.0.2" date="2020-07-20">
      Correct svd file.
        </release><release version="1.0.3" date="2020-08-22">
      Correct DBGMCU->IDCODE_B.REVID bitOffset and bitWidth.
        </release><release version="1.0.4" date="2020-09-17">
      Change the url.
		</release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>APEX</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package APEX Microelectronics</keyword>
        <keyword>APM32F1</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32F1 Series" Dvendor="APEXMIC:153">
            <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
            <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
            <description>
APEX Microelectronics' APM32F1 series of mainstream MCUs are 32-bit microprocessors based on ARM Cortex'-M3 core, with a maximum operating frequency of 96MHz. Built-in AHB high-performance bus, combined with high-speed memory and DMA, can achieve rapid data processing and storage. Built-in APB advanced peripheral bus extends the rich peripherals and enhanced I/O, guarantees the rapidity of connection and flexibility of control. The chip is equipped with powerful FPU floating-point processing unit, which supports single-precision data processing instructions and data types. 
            </description>
            <!-- ************************  Subfamily 'APM32F103'  **************************** -->
            <subFamily DsubFamily="APM32F103">
                <feature type="WDT" n="2"/>
                <feature type="RTC" n="32768"/>
                <feature type="VCC" n="2.00" m="3.60"/>
                <feature type="Temp" n="-40" m="85"/>
                <feature type="Temp" n="-40" m="105"/>
                <feature type="USBD" n="1"/>  
                <feature type="CAN" n="1"/>
                <!-- *************************  Device 'APM32F103RC'  ***************************** -->
                <device Dname="APM32F103RC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="51"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device> 
                <!-- *************************  Device 'APM32F103RD'  ***************************** -->
                <device Dname="APM32F103RD">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00060000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="51"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device>         
                <!-- *************************  Device 'APM32F103RE'  ***************************** -->
                <device Dname="APM32F103RE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="16"/>
                    <feature type="IOs" n="51"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device>    
                <!-- *************************  Device 'APM32F103VC'  ***************************** -->
                <device Dname="APM32F103VC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>        
                <!-- *************************  Device 'APM32F103VD'  ***************************** -->
                <device Dname="APM32F103VD">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00060000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>
                <!-- *************************  Device 'APM32F103VE'  ***************************** -->
                <device Dname="APM32F103VE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>  
