stops-top/H-Tool/PC/h7toolPC_release/EMMC/H7-TOOL/Programmer/Device/Geehy/APEXMIC.APM32F1xx_DFP.pdsc
        <condition id="APM32F1xx">
            <description>APEX Microelectronics APM32F1xx Device</description>
            <require Dvendor="APEXMIC:153" Dname="APM32F1*"/>
        </condition>
        <condition id="APM32F1xx LD">
            <description>APEX Microelectronics APM32F1xx Low Density Device</description>
            <require Dvendor="APEXMIC:153" Dname="APM32F10[123]?[46]"/>
        </condition>
        <condition id="APM32F1xx MD">
            <description>APEX Microelectronics APM32F1xx Mid Density Device</description>
            <require Dvendor="APEXMIC:153" Dname="APM32F10[123]?[8B]"/>
        </condition><condition id="APM32F1xx HD">
            <description>APEX Microelectronics APM32F1xx High Density Device</description>
            <require Dvendor="APEXMIC:153" Dname="APM32F10[123]?[CDE]"/>
        </condition>
        <condition id="APM32F1xx LD ARMCC">
            <description>filter for APM32F1xx Low Density Device and the ARM compiler</description>
            <require condition="APM32F1xx LD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F1xx MD ARMCC">
            <description>filter for APM32F1xx Mid Density Device and the ARM compiler</description>
            <require condition="APM32F1xx MD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F1xx HD ARMCC">
            <description>filter for APM32F1xx High Density Device and the ARM compiler</description>
            <require condition="APM32F1xx HD"/>
            <require Tcompiler="ARMCC"/>
        </condition><condition id="APM32F1xx CMSIS">
            <description>APEX Microelectronics APM32F1xx Device with CMSIS</description>
            <require condition="APM32F1xx"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
        <condition id="APM32F1xx STDPERIPH">
            <description>APEX Microelectronics APM32F1xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32F1xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32F1xx STDPERIPH RCM">
            <description>APEX Microelectronics APM32F1xx with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32F1xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="APM32F1xx CMSIS">
            <description>System Startup for APEX Microelectronics APM32F1xx device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Source/ARM/startup_apm32f10x_md.s" attr="config" version="1.0.0" condition="APM32F1xx MD ARMCC"/><file category="source" name="Device/Source/ARM/startup_apm32f10x_hd.s" attr="config" version="1.0.0" condition="APM32F1xx HD ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Source/system_apm32f10x.c" attr="config" version="1.0.0"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        <!-- START: APEX Microelectronics Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/StdPeriph_Driver/inc/"/>
                <file category="header" name="Device/StdPeriph_Driver/inc/misc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/misc.c"/>
                <file category="source" name="Device/StdPeriph_Driver/templates/apm32f10x_conf.h" attr="config" version="1.0.0"/>
                <file category="header" name="Device/StdPeriph_Driver/templates/apm32f10x_it.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/StdPeriph_Driver/templates/apm32f10x_it.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32F10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_adc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BAKR" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>Backup registers (BAKR) driver for APM32F10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_BAKR      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_bakr.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_bakr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_can.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH ">
            <description>CRC calculation unit (CRC) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_crc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_crc.c"/>
            </files>
        </component>
