stops-top/H-Tool/PC/h7toolPC_release/EMMC/H7-TOOL/Programmer/Device/Geehy/APEXMIC.APM32F1xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_dma.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_eint.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>Flash memory controller driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_fmc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_gpio.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_i2c.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SCI2C" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>SC Inter-integrated circuit (SCI2C) interface driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SCI2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_sci2c.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_sci2c.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.0" condition="APM32F1xx STDPERIPH ">
            <description>Independent watchdog (IWDT) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_iwdt.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_pmu.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_rcm.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_rcm.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_spi.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="QSPI" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Queued Serial peripheral interface (QSPI) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_QSPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_qspi.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_qspi.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_tmr.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_tmr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_usart.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_wwdt.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_wwdt.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EMMC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>EMMC driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EMMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_emmc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_emmc.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDRC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>SDRC driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_sdrc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_sdrc.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_dac.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_dac.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_dbgmcu.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_dbgmcu.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCM">
            <description>Secure digital (SDIO) interface driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_sdio.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_sdio.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_rtc.h"/>
                <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_rtc.c"/>
            </files>
        </component>
