stops-top/H-Tool/PC/h7toolPC_release/EMMC/H7-TOOL/Programmer/Device/Geehy/APEXMIC.APM32F1xx_DFP.pdsc
        <!-- END: APEX Microelectronics Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="APEXMIC" name="APM32F103MINI" revision="Ver 1.0">
            <description>APEXMIC APM32F103 Development Board</description>
            <image large="Boards/APEXMIC/APM32F103MINI/Documentation/APM32E103-MINI.JPG"/>
            <mountedDevice deviceIndex="0" Dvendor="APEXMIC:153" Dname="APM32F103VB"/>
            <compatibleDevice deviceIndex="0" Dvendor="APEXMIC:153" DsubFamily="APM32F103"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board>
    </boards>
    <examples>
        <example name="Blinky" doc="Abstract.txt" folder="Boards/APEXMIC/APM32F103MINI/Blinky">
            <description>APM32_MINI  Blinky example</description>
            <board name="APM32F103MINI" vendor="APEXMIC"/>
            <project>
                <environment name="uv" load="Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
            </attributes>
        </example>
    </examples>
</package>